; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v12 ?v9)
             (pred_4 ?v10 ?v1)
             (pred_7 ?v12 ?v1)
             (pred_9 ?v3 ?v12 )
	     (pred_10 ?v12)
             (pred_5 ?v8)
             (pred_8 ?v10)
             (pred_6 ?v1)
             (pred_3 ?v12)
             (pred_1 ?v10)
             (pred_2 ?v12)
             (pred_12 ))



(:action op_5
:parameters (?v7 ?v13 ?v4 ?v11)
:precondition (and (pred_5 ?v7) (pred_5 ?v13) (pred_8 ?v4) (pred_6 ?v11)
          (pred_11 ?v7 ?v13) (pred_4 ?v4 ?v11)
                   (pred_7 ?v13 ?v11) (pred_10 ?v7) 
                   (pred_3 ?v13) (pred_1 ?v4))
:effect (and  (pred_2 ?v13) (not (pred_3 ?v13))))


(:action op_3
:parameters (?v7 ?v2)
:precondition (and (pred_5 ?v7) (pred_5 ?v2)
               (pred_10 ?v7) (pred_11 ?v7 ?v2) (pred_2 ?v2))
:effect (and (pred_10 ?v2) (not (pred_10 ?v7))))

(:action op_4
:parameters (?v7 ?v4)
:precondition (and (pred_5 ?v7) (pred_8 ?v4) 
                  (pred_10 ?v7) (pred_9 ?v4 ?v7) (pred_12 ))
:effect (and (pred_1 ?v4)
   (not (pred_9 ?v4 ?v7)) (not (pred_12 ))))


(:action op_1
:parameters (?v7 ?v6 ?v5)
:precondition (and (pred_5 ?v7) (pred_8 ?v6) (pred_8 ?v5)
                  (pred_10 ?v7) (pred_1 ?v5) (pred_9 ?v6 ?v7))
:effect (and (pred_1 ?v6) (pred_9 ?v5 ?v7)
        (not (pred_1 ?v5)) (not (pred_9 ?v6 ?v7))))

(:action op_2
:parameters (?v7 ?v4)
:precondition (and (pred_5 ?v7) (pred_8 ?v4) 
                  (pred_10 ?v7) (pred_1 ?v4))
:effect (and (pred_12 ) (pred_9 ?v4 ?v7) (not (pred_1 ?v4)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_03 obj_01 obj_09 obj_10 obj_06 obj_11 obj_05 obj_08 obj_04
    obj_12 obj_07
    obj_13 obj_02
    )

    (:init
       (pred_12)

       (pred_5 obj_03)
       (pred_5 obj_01)
       (pred_5 obj_09)
       (pred_5 obj_10)
       (pred_5 obj_06)
       (pred_5 obj_11)
       (pred_5 obj_05)
       (pred_5 obj_08)
       (pred_5 obj_04)
       (pred_6 obj_12)
       (pred_6 obj_07)
       (pred_8 obj_13)
       (pred_8 obj_02)

       (pred_11 obj_03 obj_10)
       (pred_11 obj_03 obj_01)
       (pred_11 obj_01 obj_06)
       (pred_11 obj_01 obj_09)
       (pred_11 obj_01 obj_03)
       (pred_11 obj_09 obj_11)
       (pred_11 obj_09 obj_01)
       (pred_11 obj_10 obj_05)
       (pred_11 obj_10 obj_06)
       (pred_11 obj_10 obj_03)
       (pred_11 obj_06 obj_08)
       (pred_11 obj_06 obj_11)
       (pred_11 obj_06 obj_01)
       (pred_11 obj_06 obj_10)
       (pred_11 obj_11 obj_04)
       (pred_11 obj_11 obj_09)
       (pred_11 obj_11 obj_06)
       (pred_11 obj_05 obj_08)
       (pred_11 obj_05 obj_10)
       (pred_11 obj_08 obj_04)
       (pred_11 obj_08 obj_06)
       (pred_11 obj_08 obj_05)
       (pred_11 obj_04 obj_11)
       (pred_11 obj_04 obj_08)
       (pred_3 obj_08)
       (pred_3 obj_11)
       (pred_7  obj_08 obj_12)
       (pred_7  obj_11 obj_07)
       (pred_2 obj_03)
       (pred_2 obj_01)
       (pred_2 obj_09)
       (pred_2 obj_10)
       (pred_2 obj_06)
       (pred_2 obj_05)
       (pred_2 obj_04)

       (pred_4  obj_13 obj_12)
       (pred_4  obj_02 obj_07)
       (pred_9 obj_13 obj_10)
       (pred_9 obj_02 obj_05)
       (pred_10 obj_01)
    )

    (:goal (and
       (pred_9 obj_13 obj_01)
       (pred_9 obj_02 obj_10)
    ))
(:constraints
  (always (not (pred_10 obj_03)))
)
)

; plan
1. (op_3 obj_01 obj_06)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_06)
   goals met: 0 of 2
2. (op_3 obj_06 obj_10)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_10)
   goals met: 0 of 2
3. (op_4 obj_10 obj_13)
   deleted: (pred_9 obj_13 obj_10) (pred_12)
   added: (pred_1 obj_13)
   goals met: 0 of 2
4. (op_3 obj_10 obj_05)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_05)
   goals met: 0 of 2
5. (op_1 obj_05 obj_02 obj_13)
   deleted: (pred_1 obj_13) (pred_9 obj_02 obj_05)
   added: (pred_1 obj_02) (pred_9 obj_13 obj_05)
   goals met: 0 of 2
6. (op_3 obj_05 obj_10)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_10)
   goals met: 0 of 2
7. (op_2 obj_10 obj_02)
   deleted: (pred_1 obj_02)
   added: (pred_12) (pred_9 obj_02 obj_10)
   goals met: 1 of 2
8. (op_3 obj_10 obj_05)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_05)
   goals met: 1 of 2
9. (op_4 obj_05 obj_13)
   deleted: (pred_9 obj_13 obj_05) (pred_12)
   added: (pred_1 obj_13)
   goals met: 1 of 2
10. (op_3 obj_05 obj_10)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_10)
   goals met: 1 of 2
11. (op_3 obj_10 obj_06)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_06)
   goals met: 1 of 2
12. (op_3 obj_06 obj_01)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_01)
   goals met: 1 of 2
13. (op_2 obj_01 obj_13)
   deleted: (pred_1 obj_13)
   added: (pred_12) (pred_9 obj_13 obj_01)
   goals met: 2 of 2
